/*
 * LCD.h
 *
 * Created: 29.02.2020 13:30:39
 *  Author: GaD_Bogdan
 */ 


#ifndef LCD_H_
#define LCD_H_

#include "main.h"
//===================================================================================================================
/* Определение ножек, на которых будет висеть LCD дисплей*/
#define LCD_data_port PORTC		// Порт на котором будут висеть пины данных D4-D7
#define LCD_data_PIN_shift 0	/* Сдвиг пинов относительно нулего (если 0, то D7-D4 есть пины с 3-0
									   если 2, то D7-D4 есть 5-2 и т.д.*/ 
#define LCD_E_port PORTC        // Порт куда подключили E
#define LCD_E_pin 4			// Пин куда подключили E
#define LCD_RW_port PORTC       // Порт куда подключили RW
#define LCD_RW_pin 5			// Пин куда подключили RW
#define LCD_AO_port PORTB       // Порт куда подключили AO
#define LCD_AO_pin 0			// Пин куда подключили AO
//===================================================================================================================
#define LCD_shift_display_right LCD_send_com(0b00011000) // Сдвиг дисплея направо на 1 символ
#define LCD_shift_display_left LCD_send_com(0b00011100) // Сдвиг дисплея налево на 1 символ
//===================================================================================================================

/*Инициализация дисплея, вызвать вначале программы*/
void LCD_init(void);

//===================================================================================================================

/*Отправка на дисплей символа*/
void LCD_send_char(uint8_t data);

//===================================================================================================================

/*Отправка на дисплей команды*/
void LCD_send_com(uint8_t data);

//===================================================================================================================

/*Отправка на дисплей строки*/
void LCD_send_string(char *string);

//===================================================================================================================

/*Установка курсора в определенную позицию*/
void LCD_set_pos(uint8_t x, uint8_t y);

//===================================================================================================================
#define set_E		LCD_E_port |= (1<<LCD_E_pin)    // устновка пина E в 1
#define clear_E		LCD_E_port &= ~(1<<LCD_E_pin)	// устновка пина E в 0
#define set_RW		LCD_RW_port |= (1<<LCD_RW_pin)	// устновка пина RW в 1
#define clear_RW	LCD_RW_port &= ~(1<<LCD_RW_pin)	// устновка пина RW в 0
#define set_AO		LCD_AO_port |= (1<<LCD_AO_pin)	// устновка пина A0 в 1
#define clear_AO	LCD_AO_port &= ~(1<<LCD_AO_pin)	// устновка пина A0 в 0
//===================================================================================================================

#endif /* LCD_H_ */