/*
 * main.h
 *
 * Created: 2/03/2020 12:08:19 AM
 *  Author: GaD_Bogdan
 */ 


#ifndef MAIN_H_
#define MAIN_H_

//-------------------------------------------------------------------------------------------------------------------
#define  F_CPU 16000000UL   // Частота процессора
//-------------------------------------------------------------------------------------------------------------------
#include <avr/io.h>   
//-------------------------------------------------------------------------------------------------------------------
#include <stdio.h>
//-------------------------------------------------------------------------------------------------------------------
#include <util/delay.h>  // Библиотека задержек
//-------------------------------------------------------------------------------------------------------------------
#include <avr/interrupt.h>  // Библиотека для обработки прерываний
//-------------------------------------------------------------------------------------------------------------------
#include <stdlib.h>  // Стандартная библиотека Си
//-------------------------------------------------------------------------------------------------------------------
//#include "binary_decimal_code.h"  
                                               /* Преобразование числа в двоично-десятичный код
                                               здесь же таблица для 7-сегментного индикатора */
//-------------------------------------------------------------------------------------------------------------------
//#include "lcd_lib_2.h" // Библиотека управления LCD. (необходимо включить в проект lcd_lib_2.c!!!!)
//-------------------------------------------------------------------------------------------------------------------
//#include "PWM.h" // Библиотека для настроек ШИМ
//-------------------------------------------------------------------------------------------------------------------
//#include "USART.h" // Библиотека для настроек USART
//-------------------------------------------------------------------------------------------------------------------
//#include "EEPROM.h"  // Библиотека для работы с EEPROM
//-------------------------------------------------------------------------------------------------------------------
//#include "TWI.h" // Библиотека работы с интерфесом TWI
//-------------------------------------------------------------------------------------------------------------------
//#include "DS3231.h" // Подключаем библиотеку работы с RTC DS3231
//-------------------------------------------------------------------------------------------------------------------
#include "LCD.h" // Подключаем библиотеку работы с SPI
//-------------------------------------------------------------------------------------------------------------------
#include "SPI.h" // Подключаем библиотеку работы с LCD
//===================================================================================================================

// Макросы побитной записи/проверки битов в регистре //

#define SetBit(reg, bit)       reg |= (1<<(bit))  /* установка бита в регистре */
#define ClearBit(reg, bit)	   reg &= (~(1<<bit)) /* очистка бита в регистре */
#define BitIsClear(reg, bit)   ((reg & (1<<bit)) == 0) /* проверка бита на 0 */
#define  BitIsSet(reg, bit)    ((reg & (1<<bit)) != 0) /* проверка бита на 1 */
#define InvBit(reg, bit)       reg ^= (1<<(bit))        /* инвентировать бит регистра */

/*
Пример использования:
SetBit(PORTA, 0);
ClearBit(PORTA, 0);
while(BitIsClear(PINA, 0))
*/

//===================================================================================================================

// Макросы доступа к регистрам //
#define DDR(port) (*((&port) - 1))
#define PIN(port) (*((&port) - 2))
/*
Пример использования:
#define LED_PIN 5
#define LED_PORT PORTC

SetBit((DDR(LED_PORT)), LED_PIN);
SetBit((LED_PORT, LED_PIN);
*/

//===================================================================================================================
#endif /* MAIN_H_ */