/*
 * SPI.h
 *
 * Created: 05.06.2020 17:55:24
 *  Author: GaD_Bogdan
 */ 


#ifndef SPI_H_
#define SPI_H_

#include "main.h"

//===================================================================================================================
/* Определение ножек, на которых будут висеть ведомые устройства*/
#define SPI_slaves_port		PORTC			// Порт, к которому подключены ножки SS ведомых устройств
#define SPI_slave1_pin		0				// Ножка с первым ведомым устрйоством
#define SPI_slave2_pin		1				// Ножка со вторым ведомым устрйоством
#define SPI_slave3_pin		2				// Ножка с третьим ведомым устрйоством
#define SPI_slave4_pin		3				// Ножка с четвертым ведомым устрйоством

//===================================================================================================================

/*Инициализация SPI интерфейса в качестве мастера*/
void SPI_MS_init(void);

//===================================================================================================================

/*Инициализация SPI интерфейса в качестве ведомого устройства*/
void SPI_SL_init(void);

//===================================================================================================================

/*Передача мастером байта данных. Возвращает полученный от ведомого байт*/
uint8_t SPI_MS_send_byte(uint8_t byte);

//===================================================================================================================

/*Передача мастером байта данных. Возвращает полученный от ведомого байт*/
void SPI_MS_send_uint32_t(uint8_t * p8_data32, uint8_t slaves_pin);

//===================================================================================================================



#endif /* SPI_H_ */