/*
 * main_microcontroller.c
 *
 * Created: 05.06.2020 14:03:35
 * Author : GaD_Bogdan
 */ 

#include "Libraries/main.h"
uint8_t byte_counter = 0;						// Счетчик принятый байтов
uint32_t data32;								// Переменная для данных
uint32_t coordinates[4];						// Массив для данных, полученных по UART
uint8_t * p_coordinate_1;						// Указатель на первый байт первой координаты
//===================================================================================================================
void wait_while_devices_busy(void);
//===================================================================================================================
int main(void)
{
	p_coordinate_1 = (uint8_t *)coordinates;	// Инициализируем указатель на 
	SPI_MS_init();								// Инициализируем SPI как ведущее устрйство
	USART_Init(16);								// Инициализируем USART, скорость 115200
	USART_Transmit(120);						// Просим у комьютера координаты для приводов
	wait_while_devices_busy();					// Ждем пока устройства освободятся
    while (1) 
    {
		if (byte_counter == 16)
		{
			byte_counter = 0;
			SPI_MS_send_uint32_t(p_coordinate_1, SPI_slave1_pin);				// Передаем координаты первому устройству
			SPI_MS_send_uint32_t((p_coordinate_1 + 4), SPI_slave2_pin);			// Передаем координаты второму устройству
			SPI_MS_send_uint32_t((p_coordinate_1 + 8), SPI_slave3_pin);			// Передаем координаты третьему устройству
			SPI_MS_send_uint32_t((p_coordinate_1 + 12), SPI_slave4_pin);		// Передаем координаты четвертому устройству
			USART_Transmit(120);					// Говорим компьютеру, что готовы получить следующие данные
			wait_while_devices_busy();				// Ждем, пока все устройства выполнят свою работу
			_delay_us(20);
		}
    }
}
//===================================================================================================================
ISR(USART_RX_vect)
{
	*(p_coordinate_1 + byte_counter) = UDR0;
	byte_counter++;
}
//===================================================================================================================
void wait_while_devices_busy(void)
{
	DDRD = 0b00001111;							// Ножки 4-7 на вход
	PORTD |= 0b11110000;						// Подтяжка к 1 на ножках 4-7
	while(1)									// Ждем пока все устройства будут готовы
	{
		_delay_us(20);
		if (((PIND & 0b11110000) == 0b11110000))
		{
			break;
		}
	}
}
//===================================================================================================================



