/*
 * USART.c
 *
 * Created: 2/24/2020 12:35:10 AM
 *  Author: GaD_Bogdan
 */ 

#include "USART.h"
//===================================================================================================================
void USART_Init(unsigned int reg_UBRR_value)	// Инициализация USART
{
	UBRR0 = reg_UBRR_value;
	UCSR0B = (1<<RXEN0)|(1<<TXEN0);				// Включаем прием и передачу данных по USART
	UCSR0B |= (1<<RXCIE0);						// Разрешаем прерывания при приеме
	UCSR0A |= (1<<U2X0);						// Удваиваем скорость передачи
	UCSR0C = (1<<UCSZ01)|(1<<UCSZ00);			// Выбираем 8-битный режим предачи данных
	UCSR0C |= (1<<USBS0);						// Выбираем два стоп-бита
	asm("nop");
}
//===================================================================================================================
void USART_Transmit(unsigned char data)
{
	while ( !(UCSR0A & (1<<UDRE0)) );	// Ждем пока регистр приема-передачи данных освободится
	UDR0 = data;						// Начало передачи данных
}
//===================================================================================================================
void USART_sendStr(char *string)
{
	while (*string) // Пока не наткнемся на 0, означающий конец строчного массива
	{
		USART_Transmit(*string++); // Передаем в UART текущий байт нашего массива, после чего
		                           //                                инкрементируем указатель
	}
}
//===================================================================================================================
