/*
 * USART.h
 *
 * Created: 2/24/2020 12:35:10 AM
 *  Author: GaD_Bogdan
 */ 
#ifndef USART_H_
#define USART_H_

#include "main.h"
//===================================================================================================================

/*Инициализация USART с выбором скорости через регистр UBBR*/
void USART_Init(unsigned int reg_UBRR_value);

//===================================================================================================================

/*Отправляет один байт данных в UART*/
void USART_Transmit(unsigned char data);

//===================================================================================================================

/*Отправляем последовательно набор символов из переданной строки*/
void USART_sendStr(char *string);

//===================================================================================================================

#endif /* USART_H_ */